{"class_name": "Functional", "config": {"name": "baseline-model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 23], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_6"}, "name": "input_6", "inbound_nodes": []}, {"class_name": "BatchNormalization", "config": {"name": "bn-input", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.9, "epsilon": 0.0001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn-input", "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "hidden-dense-1", "trainable": true, "dtype": "float32", "units": 10, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}, "shared_object_id": 8}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "hidden-dense-1", "inbound_nodes": [[["bn-input", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn-1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.9, "epsilon": 0.0001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn-1", "inbound_nodes": [[["hidden-dense-1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "act_1", "trainable": true, "dtype": "float32", "activation": "tanh"}, "name": "act_1", "inbound_nodes": [[["bn-1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "hidden-dense-2", "trainable": true, "dtype": "float32", "units": 7, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}, "shared_object_id": 8}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "hidden-dense-2", "inbound_nodes": [[["act_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn-2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.9, "epsilon": 0.0001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn-2", "inbound_nodes": [[["hidden-dense-2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "act_2", "trainable": true, "dtype": "float32", "activation": "tanh"}, "name": "act_2", "inbound_nodes": [[["bn-2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "hidden-dense-3", "trainable": true, "dtype": "float32", "units": 5, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}, "shared_object_id": 8}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "hidden-dense-3", "inbound_nodes": [[["act_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn-3", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.9, "epsilon": 0.0001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn-3", "inbound_nodes": [[["hidden-dense-3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "act_3", "trainable": true, "dtype": "float32", "activation": "tanh"}, "name": "act_3", "inbound_nodes": [[["bn-3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense-output", "trainable": true, "dtype": "float32", "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense-output", "inbound_nodes": [[["act_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "dtype": "float32", "activation": "linear"}, "name": "activation_5", "inbound_nodes": [[["dense-output", 0, 0, {}]]]}], "input_layers": [["input_6", 0, 0]], "output_layers": [["activation_5", 0, 0]]}, "keras_version": "2.6.0", "backend": "tensorflow"}